#1)შემოატანინე მომხმარებელს რიცხვი და თუ უარყოფითი იყო ეგ რიცხვი დაბეჭდე შენ ტოლმისთვის მზად არ ხარ თუ დადებითია დაბეჭდე ოხ რამხელა ბიჭი ხარ ცოლის მოყვანას როდის აპირებ 

number = input("10:")
print("if false შენი ტოლმისთის  მზად არ ხარ")
print("if true ოხ რამხელა ბიჭი ხარ ცოლის მოყვანას როდის აპირებ ")



#2)შემოატანინე მომხმარებელს რიცხვი და მაგ 10 და დაითვალოს უკუღმა 

sum = 11
for i in range (0,11):
    sum+-1
    print(sum)
 

#3)გამოატანინე მომხმარებელს ნადირი ვარ ნადირი 6 ჯერ 


for i in range(0,7):
    print("ნადირი ვარ")



#4)შექმენი list სადაც ეწერება georgia და გამოიტანე მხოლოდ gia 

a = [ "georgia" ]
print(a[:4])



#5)შექმენით list სადაც იქნება თქვენი საყვარელი მენტორები და დაპრინტეთ საუკეთესო მენტორები


a2 = [ "ioane sarishvili maswavlebeli" , "gurami maswavlebeli", "aleksandre dzukaevi maswavlebeli", ]
print=(a2[0:3])