#1) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა რიცხვი, ხოლო ამ ფუნქციამ უნდა დაბეჭდოს 1-დან გადმოცემულ რიცხვამდე ყველა რიცხვი

number = int(input("დაბჩდე 1-დან გადმოცემული რიცხვები: "))

def greet(numbers):
     return number ,"1"

def number(numbers):
     result =''
     for i in number:
      print(numbers("1, 2, 3, 4, 5, 6, 7"))


#2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სახელი და დაბეჭდავს მისთვის მიესალმებას (მაგალითად: "Hello ixvis tolma"). გამოძახეთ ეს ფუნქცია 2-ჯერ და გადაეცით სხვადასხვა სახელი

name = int(input("დაბედეთ მისთვის მისალმება(hello ixis toma): "))


def greet(name):
    print("hello ixvis tolma")

greet("anna")
greet("lika")




#3) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 2 რიცხვი. ფუნქციამ უნდა დაბეჭდოს ამ რიცხვების ნამრავლი. საბოლოოდ გამოიძახეთ ის

number = int(input("დაბექდეთ ამ რიცხვის ნამრავლი:"))

def gamravleba(a, b):
    result = a + b
    print("გაამრავლეთ რიცხვები")
   

#4) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სია. ფუნქციამ უნდა დაბეჭდოს ეს სია შებრუნებულად(არ გამოიყენოთ slicing-ი)

def greet(numbers):
   print("numbers")
   
   numbers = [ 1, 2, 3, 4, 5, 6, ]
   print(numbers)


#5) შექმენით ფუნქცია, რომელსაც გადასცემთ რიცხვების სიას. გადაუარეთ გადმოცემულ სიას for ციკლით და დააბრუნეთ ახალი სია, სადაც ჩამატებული იქნება გადმოცემული სიიდან მხოლოდ ის რიცხვები, რომლებიც მეტია 10-ზე. საბოლოოდ დააბრუნეთ ეს სია


def numbers(sia):
    for numbers in "sia":
     if number > 10:
        return numbers
    sia = [1, 8, 5, 13, 2, 30]
    print("გამოვიტანოთ რიცხვები რომელიც მეტია 10-ზე")




#6) შექმენით ფუნქცია, რომელსაც გადაეცემა სიმბოლოების სია. ფუნქციამ უნდა დააბრუნოს ეს სია პირველი და ბოლო ელემენტების გარეშე, გამოიყენეთ slicing-ი


def numbers(sia):
    return sia[1,2,3,4,5]

print("უნდა დააბრუნოთ პირველი სა ბოლო ელემენტების გარესე:")



#7) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვების სია, გადაურეთ ორივეს for ციკლით და გაიგეთ თითოეულ სიაში რიცხვების ჯამი(შეინახეთ ცალკე ცვლადებში), გაამრავლეთ ორივე ერთმანეთზე და დააბრუნეთ


def two_sias_numbers(sia1,sia2):
    tjami = 0
    for sia1 in sia2:
        jami = 0

        for sia2 in sia1:
            jami = 1
        print("გამოიტანე პირველი სიის ჯამი:")
        print("გამოიტანე მეორე სიის ჯამი:")



#8) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას while ციკლით და ჩაამატეთ გაორმაგებული რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია


def two_numbers(numbers):
    i = 0
    while i < len(numbers):
        i += 1
        return i
    
    print("დავაბროთ გაორმაგებული სია:")
        


#9) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას for ციკლით და ჩაამატეთ მხოლოდ ლუწი რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია


def luwebi(sia):
   for number in sia:
      sia = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
      result= luwebi
      print("ლუწი რიცხვები:")
   
#10) შექმენით ფუნქცია, რომელსაც გადაეცემა სახელების სია. შექმენით ახალის სია, სადაც ჩაამატებთ გადმოცემული სიიდან მხოლოდ იმ სახელებს, რომლებიც იწყება "N"-ზე`. საბოლოოდ დააბრუნეთ ეს სია




#11) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა ორი რიცხვი, ხოლო ამ ფუნქციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მე-2 რიცხვის ხარისხში
#ანდრია
#მგონი ესენიც გეყოფა? 
#ანდრია

def andrea_mgoniesecgeyofa_andrea(first,second):
    return first + second 


#12) შექმენით ფუნქცია, რომელიც მიიღებს წინადადებას და დაბეჭდავს მის თითოეულ სიტყვაში სიმბოლოების რაოდენობას(ცალ-ცალკე)

