def number_squares():
    return[x * 2 for x in list]
 

#5) შექმენით ფუნქცია და არგუმენტად გადაეცით String-ი. ფუნქციამ ეგრედწოდებულად უნდა "გაფილტროს" ეს სტრინგი თანხმოვანი ასოებისგან და მხოლოდ დააბრუნოს ის ხმოვანი ასოები, რომლებსაც ეს სტრინგი შეიცავს.


def argument_string(list):
    return " ".join(["s for x in s if x in list"])


#6) შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ უარყოფითი რიცხვები.

def number_negative():
    return(x for x in list < 0)


#7) წინა დავალების ანალოგიურად შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ამ შემთხვევაში ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ დადებითი რიცხვები.

def number_positive(list):
    return[x for x in list > 0]


#8) შექმენით ფუნქცია და მას პარამეტრად  გადაეცით ერთი რიცხვი. ფუნქციამ უნდა დააბრუნოს ეს რიცხვი აყანილი კვადრატში და გამრავლებული 10-ზე. (ხარისხში აყვანის ოპერატორის შესახებ მოიძიეთ რესურსები, რათა გამოიყენოთ დავალებაში.)


def time_square(n):
    return (n * 2) * 10


#9) შექმენით ფუნქცია. მას გადაეცით ორი პარამეტრი: x და y რიცხვები. ფუნქციამ უნდა დააბრუნოს x რიცხვი აყვანილი y ხარისხში.

def number(x, y):
    return x * y
