#1)მომხმარებელს შეიყვანს თვის ნომერს (1-12) და პროგრამა ამოიცნობს სეზონს (ზამთარი, გაზაფხული, ზაფხული, შემოდგომა)

score =int(input(" შეიყვანეთ თვის ნომერი (1-12):"))

if score >= 11 and score <=12:
    print("ზამთარი")
elif score >=10:
    print("გაზაფხული")
elif score >=9:
    print("ზაფხული")
else:
    print("შემოდგომა")

 
#2)მომხარებელს შემოაყვანინეთ რიცხვი და დაადგინეთ უარყოფითია თუ დადებითი
number = int(input('Enter number: '))
if number < 0:
    print('uaryofiti')
elif number > 0 :
    print('dadebiti')


#3)ახსენი რა არის if else elife 

# if - ვიყენბთ კოდის დასაწერად
# else - ვიყენებთ რომ ბოლოს გამოიტაბოს კოდი
# elif - ბევრჯერ if ის დაწერა არ შეიძლება რადგან ერორს გამოიტანს და if ანაცვლებს


#4)მომხმარებლის ასაკი და შემოსავალი თუ ასაკი < 18 ან შემოსავალი < 10000 გათავისუფლებული ხარ სხვა შემთხვევაში გადასახადი გადასახდელია

if 14 < 18:
    print("age")
elif 14 < 10000:
    print("age2")
elif "age" == "age2":
    print("age")


#5)შეიყვანე რიცხვი თუ მეტია 10 ზე დაბეჭდე მეტია თუ არა ნაკლებია

if 22 < 10:
    print("text")
else:
    print("text")