#1)შემოაყვანინეთ მომხმარებელს n რიცხვი და დაპრინტეთ ყველა რიცხვი ნოლიდან n+1-მდე

for n in range(11):
    print(n)


#2)მომხმარებელს შემოაყვანინე რიცხვი და დაბეჭდე კენტის შემთხვევაში კენტი ლეწის შემთხვევაში ლუწი

for i in range(1,3,12):
    print(i)
for a in range(0,6,11):
    print(a)




#3)შექმენი for loop- რომელიც გამოიტანს 1-100 ჩატვლით რიცხვებს და ასევე კენტია თუ ლუწი ეს რიცხვი.

for i in range(1,101):
    print(i)


#4)მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ უფრო მაღალი რიცხვი 

number = input("34:")
number2 = input("17:")

for i in range( 34 > 17):
    print(i)


#5)გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით 

name = input("ana:")

for name in range(0,11):
    print(name)


#6)sololearn დაეწიეთ აუცილებლად❤️❤️