#1)გადაიმეროთ განვლილი მასალა


#2)ახსენით კომენტარებით while loop და for loop განსხვავება 
#<--while loop-->არის კოდი რომლის საშუალებით შეგვიძლია რაიმე რიცხის იმდენჯერ გამტანა რამდებსაც მიუთითეთ
#<--for loop-->არის კოდის რის საშუალებით შეგვიძლია რიცხვის მაგალიტად 1 დან 10 მდე დათვლა და ასევე შეგვიძლია პირიქიტაც გავაკეთოთ

#3)მომხმარებელს შემოატანინეთ რიცხვი და ეს რიცხვი თუ იყო 18 მეტე დაპრინტეთ "you are big adult" "if ით გააკეთეთ"
num = int(input('Enter number: '))
if num > 18:
      print("you are big adult")
else:
      print('none')

#4)გააკეთეთ 3 დავალება while loop ით 
number = 10
while number < 15:
      print('hello')
      number+=1

#5)sololearn