# 1)მომხარებელს  შემოატანინე  ასაკი (input) ით და შეინახეთ ეგ ცვლადში და შემდეგ დაპრინტე 
age = input("Enter your age: ")
print(age)

# 2)მომხარებელს შემოატანინე სახელი, და შემდეგ მიესალმე, "გამარჯობა", სახელი

name = input ("Enter your name: ")
print("Hello "+name)


# 3)კომენტარების სახით ახსენი რა არის input და output

# input = #(კოდი რომლის საშუალებიტ შეგვიძლია ტერმინალსჰი წერა.)
# output = #(და ამით კი პირიქიტ სეგვიძლია.)


#4) debugging (გაასწორეთ შეცდომები ამ კოდში)
#6name = gurami
#print(6Name)

name = "gurami"
print(name)


#5 )boss level:მომხარებელს შემოატანიენ თავისი ასაკი და რომელ წელშიც ცხოვრობს, და დაუპრინტეთ 10 წელში რამდენი წლის იქნება და რომელი წელი იქნება მაშინ
age02 = int(input("Enter your age: "))
print(age02 + 10)


# 6)კომენტარების სახით ახსენი snake_case და camelCase
# snake_case = #(არის კოდი რომლითაც შეგვიდძლია ქვედა ტირეტი დავწეროთ მაგალითად სახელი და ა.შ მაგ: name_ana)
# camelCase = #(არის კოდი რომლის საშვალებიტ სეგიძლია ასევე სახელის წერა მაგრამ შუაში ერთი ასოს გადიდებით მაგ: myToy)


# 7)დაწერეთ ცვლადის სწორი და ცვლადის არასწორი შექმნსი გზები (изменено)

massage = "my name is anano"
print(massage)

