#1)კომენტარების სახით ახსენით რა არის ინდექსინგი, საიდან იწყება და როგორ ყალიბდება

# ინდექსინგი  - არის  ინდექსის შექმნა


#2)შექმენით სია 10 ცალი ელემენტით, შემდეგ მეხუთე ეელმენტი შეცალეთ 5 იანით, და გამოიტანეთ მეორე ელემენტის მერე ყველა არსებული ელემენტი ყაროფითი ინდექსების საშუალებით

a = [1, 2, 3, 4, 5, "5","7","8",[[1, 2, 3]]]
print(a[3])



#3)კომენტარების სახით ახსენით რა არის slicing და რაში ვიყენებთ მას, მოიყვანეთ რამდენიმე მაგალითი


# slicing - არის ამოღება. მაგალითად რაიმე ნებისმიერი რიცხვი სიაში


#4)შექმენით სია 80 ცალი ელემენტით, შემდეგ 65 ელემენტი შეცვალეთ "gurami" თ და გამოიტანეთ იგი უარყოფითი ინდექსებით

a2 = [ 60,61,62,63,64,"gurami","66","67","68", "69","70",[[71,72,73,74,75,76,77,78,79,80]] ]
print(a2[-1])
