#1)გაქვს სია სახელებით: ["გიო", "ანა", "საბა"]. დაწერე კოდი, რომელიც ყველა სახელს გააერთიანებს ერთ წინადადებაში მძიმით გამოყოფილს.

name = ["გიო", "ანა", "საბა"]
word = " , " .join(name)
print(name)

#2) შექმენი ცხოველების სია და დაამატე მასში "კუ"

animals = ["ცხენი", "სპილო", "ქათამი"]
animals.insert(1,"კუ")
print(animals)

# 3) დაბეჭდე სიის პირველი და ბოლო წევრი.(გამოიყენე ნეგატიური ინდექსები)

number = ["4", "31", "70"]
print(name.upper("0"))
print(name.len("2"))


# 4:დაწერე სტრინგი "მეგობრები" და გინდა გაიგე რამდენი ასოსა ამ სიაში. დაბეჭდე რაოდენობა

name = "friend"
string_friend = name.find()
print(string_friend)

# 5:დაგიწერია სია [მე,მიყვარს,გოა] და გაიგე გაიგო რამდენი ელემენტია ამ სიაში. დაბეჭდე რაოდენობა

name = ["მე", "მიყვარს", "გოა"]
name = " ".join(name)
print(name)

#6: შექმენი სია შენი საყვარელი 3 სიმღერა და დაუმატე მეოთხე სიმღერა "pantera" მეორე ინდექსზე

songs = ["amor plastique", "roi", "amour"]
name.insert(1,"franch songs")
print(songs)

#7:გადააქციე ლისტი სტრინგად და დაყავი თითოეული სტრინგი ამ ელემენტით "|"

food = "xinkali"
food_like = food.split(" | ")
print(food_like)


#8.გადააკეთე სტრიქონიჯერ  დიდ ასოებად მერე პატარად და საბოლოოდ პირველ ასო გაზარდე

name = "ana"
print(name.upper)
print(name.lower)
print(name.capitalize)


#9:იპოვე სიტყვა "პითონი" წინადადებაში find() ფუნქციით და დაბეჭდე მისი მდებარეობა

name = "lika"
print(name.find("პითონი"))



#10:შექმენი სია და ჩასვი "კომფეტი" მეორე პოზიციაზე insert()-ით

name = ["1","კოფეტი", "3"]
print(name.insert(1,"კომფეტი"))


# 11:დაწერე ფუნქცია double(n), რომელიც იღებს რიცხვს და აბრუნებს მის ორმაგს.

def greet(a):
    return a * 2
print(greet(2))

# 12:დაწერე ფუნქცია is_even(n), რომელიც აბრუნებს True თუ რიცხვი ლუწია, და False თუ კენტია