#1) ახსენით რა განსხვავებაა return-სა და print შორის


# return და print - რეთურნი აბრუნებს ფუნქციის მნიშვნელობას როცა ვიძახებთ მას, და ფრინტი კი თუ მასშირამეს ვწერთ მაგას გამოიტანს


#2) ახსენით როგორ იქმნება def ფუნქცია


# def - არის ფუნქცია და ფუნქციის სახელი რომელითაც შეგვიძლია ფუნქციის შექმნა სადაც ვშერთ ფუნქციას და პრინტის მაგივრათ ვწერთ რეთურნს


#3) ახსენით რას ნიშნავს keyword-ი, და ჩამოთავლეთ რამდენიმე


# keyword - არის რომ ნებისმიერ კოდს გააჩნია მნიშვნელობა და შეგვიძლია ბევრ ინდენფინკაცია. მაგ: pop, join, split, len