#1)მისალმების ფუნქცია,
#შექმენი ფუნქცია, რომელიც არაფერს იღებს და კონსოლში ბეჭდავს ტექსტს: „გამარჯობა!“.

def greet():
    print("გამარჯობა")
greet()


#2)ორის შეკრება,
#შექმენი ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი და აბრუნებს მათ ჯამს

def greet():
    print("45")
    print("9")
greet()
greet()


# 3)ლუწი თუ კენტი,
#შექმენი ფუნქცია, რომელიც იღებს ერთ რიცხვს და აბრუნებს სტრიქონს: „ლუწია“ თუ რიცხვი ლუწია, ან „კენტია“ თუ კენტია.

def greet(number):
    print("2" + number)
    print("4" + number)

greet("ლუშია")
greet("კენტია")
    

# 4)სახელი და ასაკი,
#შექმენი ფუნქცია, რომელიც იღებს მომხმარებლის სახელსა და ასაკს, და ბეჭდავს ტექსტს, მაგ: „მარიამი არის 25 წლის.“

def greet():
    name = input("enter your name:")
    age = input("enter your age:")
    print("მარიამი არის 15 წლის" + name + age)
