
#1) აუცილებლად გადახედეთ ჩანაწერს;

#2) მოიყვანეთ while loop-ის მაგალითი და კომენტარის სახით ახსენით, თუ როგორ მუშაობს while ციკლი;
#3) კომენტარის სახით ახსენით თუ რა განსხვავებაა for loop-სა და while loop-ს შორის
#<!--whileloop მაგალითი არის 1 დან 10 რაიმე რიცხვის დათვლა, while მეშაობს რიცხვის დათ₾შ და ეს უნდა მიუთითოთ-->
#<!--whileloopi while for განსხვავდება იმით რომ WHILELOOP ში სეგვიდძლი მარტო 10 დათვლა და WHILEfor კი სეგვიძლია რანდებსაც მიუთითებთ იმდენის დათვლა

#4)გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ 
i=0
while i <=14:
      print(i)
      i = i + 14

#5)გამოიტანეთ რიცხვები 10-დან 15-მდე 
i=15
while i <=10:
      print(i)
      i = i - 10
