#1)დაწერეთ while loop-ით კოდი რომელიც დაითვლის 1 დან 10 მდე

i=10
while i < 1 :
      print(i)
      i = i + 1


#2) დაწერეთ while loop-თ კოდი რომელიც დაითვლის 10-1 მდე

i=10
while i < 1:
      print(i)
      i = i + 1




#3) დაწერეთ უსასრულო while loop

i=1000
while i < 1:
      print(i)
      i = i + 1




#4) ახსენით კომენტარით რას შვება while loop

# while loop - შეუძლია უსასრულოდ გამოიტანოს ერთი რიცხვი


#5)მომხმარებელს სთხოვე შეიყვანოს პაროლი. სწორი პაროლია "1234". სანამ სწორად არ შეიყვანს, კოდი მუდმივად სთხოვს ახლიდან შეყვანას while loop-ის საშუალებით. 

i=1,2,3,4
while i < 1:
      print(i)
      i = i + 1