#1)შექმენი სია სადაც თქვენი საყვარელი საწმელები იქნება

a = ["xinkali","acharuli","mwvadi","toma","lobiani","gupta"]
print("a")


#2)შექმენით ახალი სია სადაც იქნება color ცვლადი და ცისარტყელის ფერები იქნება ცხრილში და მხოლოდ ცივ ფერებს გამოიტანეთ 

color = ["red","orange","yellow","green","blue","purple"]
print(color[3])
print(color[4])
print(color[5]) 

#3)შექმენით სია სადაც 5 ცხოველი იქნება და მხოლოდ 1indx და 2indx გამოიტანთ 

a02 = ["cat","dog","elephant","mouse","chiken","cow"]
print(a02[1])
print(a02[2])


#4)შექმენით 2 სია და  1 სიიდან 2 ინდექს მიუმატებ 2 სიის 3 ინდექს ჯამი დაპრინტეთ

a03 = ["love","kitty","candy"]
a04 = ["favourite","goa","beautiful","white"]
print(a03[2]+a04[3])

#5)კომენტარების მეშვეობით ახსენი როგორ გამოვიყენოთ სია

# სიას ვიყენებთ იმისთვის რომ გსმოვიტანოთ იმ სიაში მითითებული ჩამონათვალი