#1)კომენტარების სახით ახსენით რამდენი შედარების ოპერატორია და თითოეული რისთვის გამოიყენება 
# სულ არის 2 შესადარებლის ოპერატორი ( " > < ") ამით ჩვენ შეგვიზლია სევადაროთ და დავწერპთ კოდში

#2)კომენტარების სახით ახსენი რა განსხვავებაა and და or ლოგიკურ ოპერატორებს შორის და რა თვისებები გააჩნიათ
# and და or გაბსხვავდება იმიტ რომ "AND" ვგულისხმობტ "დას" და "OR" კი "ან" და გააჩნიათ ის რომ დაწერვის დროს როცა 
# "AND" ვწერთ მაშინ თუ არის ვტცვატ უარყოფითი და დადებითი მაინც გამოვა უარყითი, და "OR ასეც იქნება"

#3)გაარჩიეთ შემდეგი წინადადება ნაბიჯ ნაბიჯ და საბოლოოდ მიიღეთ ის პასუხი რომელიც ტერმინალში გამოვა print(True and 6<7 or "hello"!=5.4 and False or 7-7 < 9+2)
print(True and 6 > 7 or "Hello"!=5.4 and False or 7-7 < 9+2) 

# 1. იქნება სწორი ანუ 7 მეტია 6 და გამოვა "7 or hello!"
# 2. იქნება უარყოფითი რადგან ყოველთვის სადაც არის "FALSE" იქნება უარყოფითი ანუ "5.4 and false"
# 3. აქაც უარყოფითი რადგან 7-7 ნაკლებია და იქნება 0 ტოლი სესაბამისდ მედი იქნებ 9+2 და არის 11, და უაეყოფითია
# 4. ანყ გამში უარყოფიტი

#4)კომენტარების სახით ახსენი რომელ მონაცემთა ტიპებთან შეგვიძლია გამოვიყენოთ გარკვეული შედარების ოპერატორები
# ჩვენ შეგვიზლია გამოვიყენოთ "TRUE AND/OR FALSE" ოპერატორები და გვიჩვენებს და მარტალია ან/და ტყუილი "ახსნით"

#5)დაპრინტეთ ყველა შესაძლო ვარიანტი and და or ით, მაგალითი: (изменено)
print(True and False) # --- FALSE "უარყოფითი"
print(True and True) # --- TRUE "დადებითი"
print(False and False) # --- FALSE "უარყოფითი"