# ინდექსინგი - ვიყენებთ რომ შვქმნას სია და გამოვიტაოთ კონკრეტული რიცვი

a = [1, 2, 3, 4, 5, "6", "7", "8",[1, 2, 3, 4,]]
print(a[0:4])



#1)რას ეწოდება ფუნქცია?

# ფუნქცია - ფუნქცია არის კოდი რომელიც მითითებულ დავალებას ასრულებს


#2)python ში ფუნქციის შექმინის დროს რატომ ვწერთ def-ს?

# რადგან def-ით ჩვენ ვქმნით ფუნქციას სადაც ვუთითებთ სახელსაც რომელიც ეწოდება greet


##)def ის შემდეგ რა იწერება?

# იწერება ფუნქცია სადაც ვუთითებთ თუ რა უნდა შეასრულოს მან


#$)რატომ უნდა გამოვიძახოთ ფუქნცია?

# რომ დავწეროთ კოდი სადაც იქნება ფუნქცია და იქმნება def-ის მეშვეობით და შეგვიძლია მიუთითოთ სახელიც მას greet- ის მეშვეობით

#მაგ:

def greet():
    print("hello")
greet()